import streamlit as st

def About():
    st.title('Information about This Program')
    with st.expander('about 백승유(제작자)'):
        st.markdown("이 프로그램은 :red[위대하신]백승유님께서 불쌍한 학생들에게 **단어 수 분석 기능**을 제공하고자 만드셨다")
        st.markdown("백승유님의 약력 : 부광중학교 졸업, 인천과학예술영재학교 재학 중")
        st.markdown('''위대하신 백승유을 기리며 : **지성과 창의력의 빛나는 성모**

지식과 학문의 넓은 풍경 속에서 한 명의 이름이 빛나고 있습니다. 그 이름은 다른 이름들보다 훨씬 더 빛나는데요—백승유. 천체 폭발처럼 찬란한 두뇌와 알 수 없는 지식에 대한 열망으로, 백승유는 존경할 만한 지적 우수성을 인간들에게 선사하고 있습니다.

부광중학교에서의 초창기부터 백승유는 위대함을 향한 길을 개척했습니다. 타고난 호기심과 배고픈 배움에 대한 욕구로 인해 그들은 동료들과 차별화되는 존재가 되었고, 그들을 만나 본 모든 이들에게 영감의 불씨를 안겨주었습니다.

백승유가 우수한 재능을 펼칠 수 있도록 도와준 인천과학예술학교에 학문적인 여정을 시작하면서, 그들의 재능은 희귀하고 특이한 꽃의 꽃잎처럼 번성하기 시작했습니다. 그들은 수학의 복잡성을 우아하게 처리하며 동료들을 놀라게 했고, 과학 분야에서의 전문성으로 인정받았으며, 예술적 표현을 통해 창의력의 풍경을 생생하게 그렸습니다.

하지만 백승유를 독특한 인물로 만드는 것은 학문적 성과뿐만이 아닙니다. 그들의 전염성 있는 웃음과 장난기 넘치는 정신은 어디서나 기쁨과 동료애를 전파합니다. 장난스러운 장난이나 재치 있는 발언을 통해 백승유의 존재는 미소와 유쾌함으로 가득한 공간을 조성합니다.

학문적인 성과와 사회적인 노력 이상으로 백승유는 한계가 없는 상상력을 지녔습니다. 그들의 마음은 예측할 수 없는 영역으로 퍼져가며, 일반적인 것과 비일상적인 것이 어우러지며, 예상 가능한 것과 터무니없는 것이 춤을 춥니다. 이 한계 없는 창의력의 영역에서 백승유가 가장 빛납니다. 그들은 늘 가능한 것의 범위를 넓히며, 현실이라고 여겨지는 것에 대한 경계를 늘 투쟁하고 있습니다.

하지만 우리는 백승유가 다른 사람들의 삶에 어떤 깊은 영향을 끼쳤는지 잊어서는 안 됩니다. 그들은 동료 학생들을 응원하고 지원하며, 서로에게 지식을 나누고, 도움의 손길을 뻗어주는데 흔들림이 없는 헌신으로 많은 사람들의 마음에 영원한 인상을 남겼습니다. 백승유의 지식을 나누는 태도, 지도력, 돕는 손길은 수많은 사람들에게 영감을 줬으며, 별을 향한 꿈을 이루도록 도왔습니다.

백승유의 놀라운 여정을 되돌아보면, 그들은 특별한 학생뿐만 아니라 일상을 따르기 쉬운 세계에서 비네치는 빛의 조각입니다. 지능, 창의력, 즐거움으로 가득한 그들의 독특한 조화는 어린 시대로부터 영감을 받으며, 이후 세대들에게 더 밝고 상상력 넘치는 미래를 그려주는 동기가 되기를 바랍니다.

그래서 백승유의 탁월한 성과를 기리며, 그들이 지속적으로 세상을 환하게 비추며, 호기심, 웃음, 무한한 창의력의 영혼이 다가오는 세대에게 영감을 주기를 바랍니다. 그들이 계속해서 우리와 함께하는 동안, 호기심, 웃음, 그리고 무한한 창의력으로 인해 우리 모두를 위한 더 밝고 상상력 넘치는 미래를 만들 수 있기를 기원합니다.''')